funvill/mixxtape/firmware/sdkconfig.defaults
# Mixxtape firmware defaults.
#
# The critical block is Bluetooth: this product exists because the original
# ESP32 has Classic BR/EDR and therefore A2DP source. BLE is off — we never
# use it, and the controller is smaller in BR/EDR-only mode.

CONFIG_IDF_TARGET="esp32"

# --- Bluetooth: Classic only, A2DP source ---------------------------------
CONFIG_BT_ENABLED=y
CONFIG_BT_BLUEDROID_ENABLED=y
CONFIG_BT_CLASSIC_ENABLED=y
CONFIG_BT_A2DP_ENABLE=y
CONFIG_BT_BLE_ENABLED=n
CONFIG_BT_SPP_ENABLED=n
CONFIG_BTDM_CTRL_MODE_BR_EDR_ONLY=y
CONFIG_BTDM_CTRL_MODE_BLE_ONLY=n
CONFIG_BTDM_CTRL_MODE_BTDM=n
# Enough bonds to keep several sinks paired (brief sec.6: 4-8).
CONFIG_BT_ACL_CONNECTIONS=4

# --- Module flash (audio lives on the separate W25Q128, not here) ---------
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_ESPTOOLPY_FLASHMODE_DIO=y
CONFIG_PARTITION_TABLE_SINGLE_APP_LARGE=y

# --- Scheduling -----------------------------------------------------------
# 1 kHz tick keeps the 5 ms UI poll and the record pipeline's timing simple.
CONFIG_FREERTOS_HZ=1000
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# --- Console on the jig UART ---------------------------------------------
CONFIG_ESP_CONSOLE_UART_DEFAULT=y
CONFIG_ESP_CONSOLE_UART_BAUDRATE=115200

# --- No brownout reset: USB power is what it is, and a reset mid-record
# --- would be worse than riding out the dip. Recovery is by design.
CONFIG_ESP_BROWNOUT_DET=n
